Repository: robot-xliff-farmer/bem-method
Catalog: bem-method.tmx
Source language: ru
Languages: en

source: Ждать принятия pull request и закрытия issue.
en: Wait for the pull request to be accepted and the issue to be closed.

source: Команда npm run test-specs запускает юнит-тесты на JS.
en: The npm run test-specs command launches unit tests on JS.

source: Для запуска точечной сборки используйте команду enb make specs desktop.specs/<block-name> (например, enb make specs desktop.specs/input).
en: To launch point-based assembly, use the command enb make specs desktop.specs/<block-name> (for example, enb make specs desktop.specs/input).

source: Тесты запускаются автоматически на Travis для каждого pull request'а.
en: Tests will be run automatically on Travis for each pull request.

source: Для тестирования верстки используется Gemini.
en: Gemini is used for layout testing.

source: Тесты каждого блока находятся в отдельном файле вида block-name.gemini.js в директории gemini/. Локально тесты запускаются вручную. Тесты на Travis запускаются автоматически. В качестве Selenium Grid используется сервис SauceLabs.
en: Tests for each block are stored in a separate block-name.gemini.js file in the gemini/ directory. Locally, test are executed manually. On Travis, tests are executed automatically. For Selenium Grid, the SauceLabs service is used.

source: Для запуска тестов локально необходимо:
en: For executing tests locally, you need to:

source: Создайте учетную запись OpenSauce в SauceLabs.
en: Create an OpenSauce account in SauceLabs.

source: Установите утилиту Sauce Connect.
en: Install the Sauce Connect utility.

source: Настройте окружение (переменные среды SAUCE_USERNAME и SAUCE_ACCESS_KEY).
en: Set up environment variables (SAUCE_USERNAME and SAUCE_ACCESS_KEY).

source: Запустите утилиту sc (SauceConnect) и дождаться установки туннеля.
en: Launch the src utility (SauceConnect) and wait for the tunnel to be opened.

source: Запустите тесты командой npm run gemini.
en: Run the tests using npm run gemini.

source: Соберите новые версии скриншотов при необходимости командой npm run gemini-gather.
en: If you need to make new versions of screenshots, use the command npm run gemini-gather.

source: При разработке новых тестов для ускорения локального запуска:
en: When developing new tests to speed up local execution:

source: Установите и запустите Selenium Server или PhantomJS.
en: Install and run Selenium Server or PhantomJS.

source: Исправьте в файле .gemini.yml опцию gridUrl на http://localhost:4444/.
en: In the .gemini.yml file, change the gridUrl option to http://localhost:4444/.

source: Запустите тесты.
en: Run the tests.

source: https://ru.bem.info/tools/testing/gemini/
en: https://en.bem.info/tools/testing/gemini/

source: Подробно про использование Gemini с разными бекендами читайте в статье Введение в работу с Gemini.
en: For more information about using Gemini with various backends, read the article Gemini quick start.

source: NB В репозиторий необходимо сохранять скриншоты, собранные в SauceLabs. Это позволит избежать отличий в отрисовке шрифтов.
en: Note: You need to save screenshots from SauceLabs in the repository. This helps to avoid discrepancies when rendering fonts.

source: Перед коммитом новых или измененных эталонных изображений необходимо:
en: Before commiting new or modified reference images, you must:

source: Проверить корректность изображения. Для определения разницы между старой и новой версиями, используйте утилиту Araxis Merge или аналогичную.
en: Make sure the images are correct. To find differences between the old and new versions, use the Araxis Merge utility or something similar.

source: Сжать изображения с помощью ImageOptim (самый эффективный инструмент сжатия изображений на май 2014 года).
en: Use ImageOptim to compress the images (this is the most effective tool for compressing images as of May, 2014).

source: Инструменты сборки библиотеки позволяют собирать и запускать тесты на BEMHTML- и BH-шаблоны блоков.
en: Build tools for the library allow you to build and run tests on BEMHTML and BH block templates.

source: Добавление теста для блока
en: Add a test for a block

source: Создать каталог с названием [имя блока].tmpl-specs в директории блока на требуемом уровне переопределения. В данном каталоге будут храниться файлы тестов.
en: Create a directory named [block name].tmpl-specs in the block's directory at the necessary level. Test files will be stored in this directory.

source: Для каждого теста создать пару файлов: BEMJSON и HTML. В BEMJSON-файле находится пример для блока, в HTML-файле – эталонный HTML-код, который должен получиться после применения шаблона блока к BEMJSON-у примера. Имена файлов (не включая расширения) для одного теста должны совпадать. Например, 10-default.bemjson.js и 10-default.html.
en: Create a pair of BEMJSON and HTML files for each test. The BEMJSON file contains an example for the block, and the HTML file contains the sample HTML code that should result after applying the block template to the BEMJSON example. File names must match (other than the extensions) for the same test. For example, 10-default.bemjson.js and 10-default.html.

source: К блоку могут быть написаны несколько тестов и, соответственно, каждый тест будет состоять из пары файлов BEMJSON + HTML с одинаковыми именами.
en: Multiple tests can be written for a block and, accordingly, each test consists of two files (BEMJSON and HTML) with the same name.

source: Команда для сборки и запуска тестов:
en: To build and run tests, use:

source: Сборка тестов на нужном уровне переопределения:
en: To build tests on the required definition level, use:

source: Сборка тестов только для одного блока (точечная сборка):
en: To build tests only for a specific block, use:

source: В случае успешной сборки, тесты будут запущены с последующим выводом результатов. Если результат применения шаблона не совпадает с эталонным HTML, то в логе будет ошибка с указанием отличий от эталона.
en: If the build procedure is successful, tests are run automatically, and you will see all test results. If the result of applying the template does not match with the block sample in HTML, you will see an error in the log indicating how it differs from the block sample.

source: Список текущих задач отображается на специальном Agile Board.
en: Current tasks are listed on a special Agile Board.

source: Статусы задач:
en: Task statuses:

source: backlog — неразобранные задачи, которые требуют обсуждения командой для оценки и принятия решения о реализации. В таком статусе также могут находиться задачи, по которым нужна дополнительная информация.
en: backlog — Unsorted tasks that need to be discussed by the team to evaluate them and decide how to implement them. This status also applies to tasks that need additional information.

source: ready — разобранные задачи, решение о реализации которых принято.
en: ready — Tasks that have been investigated and a decision has been made on how to implement them.

source: in progress — задачи с конкретным исполнителем, которые находятся в работе.
en: in progress — Tasks that have a specific assignee and are currently in progress.

source: done — задачи, закрытые за последние семь дней (это временное техническое ограничение выбранного Agile Board).
en: done — Tasks that have been closed over the last seven days (this is a temporary technical limitation of our Agile Board).

source: Лицензия
en: License

source: © 2012 YANDEX LLC. Код лицензирован Mozilla Public License 2.0.
en: Code and documentation © 2012 YANDEX LLC. Code released under the Mozilla Public License 2.0.

source: Принципы разработки БЭМ-библиотек
en: Principles of BEM library development

source: В основе этих принципов — совокупный опыт работы нашей команды. Мы учли все лучшее из прошлого, чтобы при разработке новых библиотек не повторять прежних ошибок. Мы призываем сообщество ориентироваться на эти правила при использовании и разработке БЭМ-библиотек.
en: These principles are based on the combined experience of our team. We took all the best approaches from the past, in order to avoid repeating previous mistakes when developing new libraries. We encourage the community to follow these guidelines when using and developing BEM libraries.

source: Открытый исходный код
en: Open source code

source: Разработка библиотеки ведется на GitHub, где доступны все задачи, планы и сроки. Любой разработчик может принять участие в работе над библиотекой: создать задачу с пожеланиями для команды или прислать пулреквест.
en: The libraries are developed on GitHub, where all the tasks, plans, and deadlines are available. Any developer can participate in working on a library: create a task with requests for the team, or send a pull request.

source: Простота использования
en: Simplicity

source: Библиотека должна быть максимально простой. Откажитесь от всего, что может расцениваться или использоваться неоднозначно.
en: The library must be as simple as possible. Give up anything that could be understood or used in more than one way.

source: Минимализм
en: Minimalism

source: Проектируя необходимую функциональность, стремитесь к пересечению, а не объединению потребностей. В ситуации выбора предпочтителен тот вариант, который решает задачу меньшим количеством кода, БЭМ-сущностей или проще в поддержке.
en: When designing needed functionality, strive for intersecting needs, rather than combined features. When you have to make a choice, prefer the option that solves the problem with less code and fewer BEM entities, or the one that will be easier to support.

source: Покрытие тестами
en: Test coverage

source: Код библиотеки должен быть на 100% покрыт тестами. Это гарантирует меньшее число ошибок и экономию времени на поддержку в будущем. Код не считается законченным и стабильным, пока он не покрыт тестами. Пулреквесты без добавления или изменения тестов не принимаются.
en: The library code must be 100% covered by tests. This guarantees fewer errors and saves time on support in the future. Code is not considered finished and stable until it is covered by tests. Pull requests are not accepted if they do not add or change tests.

source: Единообразие
en: Uniformity

source: Все названия полей и методов должны быть унифицированы в рамках одной или нескольких совместимых библиотек. Если в блоке методы, модификаторы или поля называются определенным образом, то в похожей задаче нужно придерживаться той же логики именования. Последовательность и согласованность всех сущностей должны быть доведены до абсолюта и поставлены во главу угла. Важно, чтобы логика именования была понятна и другим разработчикам, которые будут использовать библиотеку или модифицировать ее код.
en: All the names for fields and methods should be standardized with one or more compatible libraries. If the methods, modifiers, or fields in a block are named in a certain way, the same naming logic must be used in a similar task. The consistency and coherency of all entities must be perfected and brought to the forefront. The naming logic must be clear to other developers who will be using the library or modifying its code.

source: Разделение на приватный и публичный API
en: Division into private and public APIs

source: Приватный API блока не должен использоваться вне этого блока.
en: A block's private API shouldn't be used outside of this block.

source: Публичный API следует делать минималистичным, не предоставляя ничего лишнего. Обязательно указывайте в документации возможные способы его использования: в BEMJSON, JavaScript или обоими способами. Стабильность публичного API гарантируется соблюдением правил семантического версионирования.
en: Make the public API minimal, without anything extra. Document the possible ways to use it: in BEMJSON, JavaScript, or both. To guarantee the stability of the public API, follow the rules of semantic versioning.

source: Тонкая настройка пользователем
en: Fine tuning by the user

source: В процессе разработки заранее продумывайте и учитывайте возможности для тонкой настройки кода на стороне пользователя.
en: During development, plan ahead to make fine tuning possible on the user side.

source: Библиотека должна поддерживать несколько тем. Это позволит корректно создавать правила форматирования для каждого стиля, а также избежать конфликтов с новыми темами. Сейчас основная тема БЭМ-библиотек — islands, в ней выполнен новый дизайн сервисов Яндекса. Реализация нескольких тем внутри одной библиотеки представлена в bem-components, где вместе с islands есть дополнительная тема simple.
en: The library must support multiple themes. This makes it possible to create formatting rules for each style, as well as avoid conflicts with new themes. The main theme of the BEM libraries right now is the "islands" theme, which implements the new design for Yandex services. The implementation of multiple themes within a single library is demonstrated in bem-components, where the "islands" theme is supplemented with the "simple" theme.

source: Явное лучше неявного (в JavaScript API)
en: Explicit over implicit (in the JavaScript API)

source: Название метода должно максимально точно отражать суть и сразу давать понять, что он реализует. Такой подход позволяет снизить порог входа и сделать API более понятным.
en: A method name must reflect the method's purpose as exactly as possible and make it immediately clear what it implements. This approach can shorten the learning curve and make the API more intuitive.

source: Сокращения в BEMJSON API
en: Shortcuts in the BEMJSON API

source: Явное лучше неявного, но в некоторых случаях в API допустимо использовать сокращения. Произвольные куски BEMJSON можно передавать только там, где это действительно необходимо — например, если сущность по своей семантике является оберткой или контейнером. Для сложных блоков, где генерация содержимого и есть внутренний API, нужно создавать сокращения, опуская поле content. Это уменьшит объем входного BEMJSON и позволит безболезненно менять внутреннее устройство сложных блоков.
en: Explicit is better than implicit, but in some cases, shortcuts can be used in the API. Custom BEMJSON chunks may be passed only where this is truly necessary — for example, if the entity is semantically a wrapper or container. For complex blocks where content generation is the internal API, you need to create shortcuts, omitting the "content" field. This reduces the volume of the BEMJSON input and makes it painless to change the internal structure of complex blocks.

source: Явные умолчания
en: Explicit defaults

source: Умолчания должны быть явно задекларированы — это внешний API. Любые их изменения препятствуют обратной совместимости. Неявные и нигде не описанные умолчания создают проблемы в поддержке библиотеки.
en: Defaults must be declared explicitly, as this is an external API. Any changes to defaults interfere with backward compatibility. Defaults that are implicit and not documented anywhere create problems for supporting the library.

source: Обработка ошибок
en: Error handling

source: Входные данные следует проверять перед использованием, генерируя в случае ошибки исключение, которое может быть обработано в вызывающем коде. Обработка ошибок должна происходить единообразно во всей библиотеке: не стоит добавлять в блок сложную валидацию данных, если в аналогичном случае она не происходит.
en: Check input data before using it. In case of an error, generate an exception that can be handled in the code being called. Error handling must be consistent across the entire library. Do not add complicated data validation to a block if it doesn't occur in a similar situation.

source: Предметная область БЭМ
en: The scope of BEM

source: Все, что может выражаться через БЭМ-сущность, должно через нее выражаться.
en: Everything that can be expressed using a BEM entity must be expressed through one.

source: БЭМ-события vs. события на изменение модификаторов
en: BEM events vs. modifier change events

source: Не нужно создавать БЭМ-событие или подписываться на него, если есть возможность работать с событием на изменение модификатора.
en: Do not create a BEM event or subscribe to one if it is possible to work with an event for changes to modifiers.

source: Модификаторы vs. специализированные поля
en: Modifiers vs. special fields

source: Модификатор — это заранее известный набор положений или состояний. Специализированное поле — заранее неизвестный набор вариативных значений. Все, что может быть выражено в виде конечного набора значений, нужно реализовывать модификатором. Где это невозможно, используйте специализированные поля.
en: A modifier is a predefined set of conditions or states. A special field is a set of variable values that are not known in advance. Everything that can be expressed as a finalized set of values should be implemented as a modifier. When this is not possible, use special fields.

source: Композиция vs. наследование vs. делегирование
en: Composition vs. inheritance vs. delegation

source: Используйте ООП только там, где это оправдано. В остальных случаях следует применять миксы, делегирование и композицию.
en: Use object oriented programming only where it is justified. In all other cases, use mixes, delegation, and composition.

source: Иерархия блоков
en: Hierarchy of blocks

source: Взаимодействие между блоками следует строить снизу вверх. Блок может взаимодействовать только с подмешанными и вложенными блоками, но не с внешними или соседними.
en: The interaction between blocks should be built from the bottom up. A block can only interact with mixed and nested blocks, not with external or nearby blocks.

source: Оптимизация на уровне блока
en: Optimization at the block level

source: Решения по оптимизации должны внедряться во время разработки каждого конкретного блока. Заранее продумывайте возможные пути оптимизации, чтобы в дальнейшем их было проще реализовать в уже написанном коде.
en: Optimization decisions must be implemented during the development of each specific block. Think through the possible ways to optimize in advance, so that later it is easier to use them in code that has already been written.

source: Автоматизация рутинных процессов
en: Automation of routine processes

source: Все повторяющиеся действия, такие как вставка картинок, расстановка префиксов, копирование стилей, следует автоматизировать. Разработчик не должен заниматься рутиной, для этого есть роботы.
en: Automate all repeated processes, such as inserting images, arranging prefixes, or copying styles. The developer shouldn't spend time on routines when there are robots to do that.

source: Мобильные платформы без адаптивной верстки
en: Mobile platforms without adaptive layout

source: https://github.com/bem/bem-components/blob/current/README.ru.md#supported-browsers
en: https://en.bem.info/libs/bem-components/current/#supported-browsers

source: https://github.com/bem/bem-components/blob/current/README.ru.md
en: https://en.bem.info/libs/bem-components/current/

source: Библиотека должна поддерживать мобильные платформы. Использовать адаптивную верстку не рекомендуется. Библиотека должна работать во всех браузерах, поддержку которых вы заявляете: допускаются деградации только стилевого оформления компонентов, но не их функциональности. Код на уровне common и desktop должен работать на тач-устройствах. Для примера ознакомьтесь со списком поддерживаемых браузеров библиотеки bem-components.
en: The library must support mobile platforms. We do not recommend using an adaptive layout. The library must work on all browsers that you declare supported: the only degradation allowed is in the styling of components, but not in functionality. Code at the "common" and "desktop" levels must work on touch devices. For an example, review the list of supported browsers for the bem-components library.

source: Доступность
en: Accessibility

source: Компоненты библиотеки должны быть доступны для чтения программами экранного доступа, но расширять для этого публичный API не следует. Выставление всех необходимых ARIA-атрибутов реализуется на уровне шаблонов и скриптов.
en: The library components must be accessible for screen reader programs, but you shouldn't expand the public API for this purpose. All the required ARIA attributes are set using templates and scripts.

source: Библиотека разрабатывается с ориентацией на будущее. Всегда используйте последние версии браузеров и инструментов, чтобы сохранить ее актуальность в процессе разработки как можно дольше.
en: The library is in development with a focus on the future. Always use the latest versions of browsers and tools, to keep the library relevant for development as long as possible.

source: внешний вид — CSS, Stylus, Sass;
en: appearance — CSS, Stylus, Sass;

source: Основные понятия БЭМ
en: BEM: Key concepts

source: Блок
en: Block

source: БЭМ-сущность
en: BEM entity

source: Микс
en: Mix

source: БЭМ-дерево
en: BEM tree

source: Реализация блока
en: Block implementation

source: Технология реализации блока
en: Block implementation technology

source: Переопределение блока
en: Block redefinition

source: Уровень переопределения
en: Redefinition level

source: Логически и функционально независимый компонент страницы, аналог компонента в Web Components. Блок инкапсулирует в себе поведение (JavaScript), шаблоны, стили (CSS) и другие технологии реализации. Независимость блоков обеспечивает возможность их повторного использования, а также удобство в разработке и поддержке проекта.
en: A logically and functionally independent page component, the equivalent of a component in Web Components. A block encapsulates behavior (JavaScript), templates, styles (CSS), and other implementation technologies. Blocks being independent allows for their re-use, as well as facilitating the project development and support process.

source: Возможности блоков
en: Block features

source: Вложенная структура
en: Nested structure

source: Блоки могут быть вложены в любые другие блоки.
en: Blocks can be nested inside any other blocks.

source: Например, блок head может включать логотип (logo), форму поиска (search) и блок авторизации (auth).
en: For example, a head block can include a logo (logo), a search form (search), and an authorization block (auth).

source: Составляющие блока Шапка
en: Head block components

source: Свободное перемещение
en: Arbitrary placement

source: Блоки можно перемещать в пределах одной страницы, разных страниц или проектов. Независимая реализация блока позволяет изменять его положение на странице и обеспечивает корректную работу и внешний вид.
en: Blocks can be moved around on a page, moved between pages or projects. The implementation of blocks as independent entities makes it possible to change their position on the page and ensures their proper functioning and appearance.

source: Так, например, логотип и форму авторизации можно поменять местами. При этом вносить изменения в CSS или JavaScript-код блока не нужно.
en: Thus, the logo and the authorization form can be swapped around without modifying the CSS or JavaScript code of the blocks.

source: Смена положения блоков
en: Altering the block positions

source: Повторное использование
en: Re-use

source: В интерфейсе может одновременно присутствовать несколько экземпляров одного и того же блока.
en: An interface can contain multiple instances of the same block.

source: Товары в интернет-магазине
en: Online store products

source: Составная часть блока, которая не может использоваться в отрыве от него.
en: A constituent part of a block that can't be used outside of it.

source: Например, пункт меню вне контекста блока меню не используется, значит является элементом.
en: For example, a menu item is not used outside of the context of a menu block, therefore it is an element.

source: Пункты меню
en: Menu items

source: Когда создавать блок, когда элемент?
en: A block or an element: when should I use which?
